test/load-tests/auth-load.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 3
      name: "Authentication load test"
  processor: "./load-test-processor.js"
  variables:
    testEmail: "loadtest{{ $randomNumber() }}@example.com"

scenarios:
  - name: "User Signup and Login Flow"
    weight: 50
    flow:
      # Get CAPTCHA
      - get:
          url: "/api/auth/captcha"
          capture:
            - json: "$.id"
              as: "captchaId"
            - json: "$.answer"
              as: "captchaAnswer"
      
      # Signup
      - post:
          url: "/api/auth/signup"
          json:
            email: "{{ testEmail }}"
            password: "Test@123456"
            firstName: "Load"
            lastName: "Test"
            role: "user"
            captchaId: "{{ captchaId }}"
            captchaAnswer: "{{ captchaAnswer }}"
          capture:
            - json: "$.token"
              as: "authToken"
      
      - think: 2
      
      # Get new CAPTCHA for login
      - get:
          url: "/api/auth/captcha"
          capture:
            - json: "$.id"
              as: "loginCaptchaId"
            - json: "$.answer"
              as: "loginCaptchaAnswer"
      
      # Login
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ testEmail }}"
            password: "Test@123456"
            captchaId: "{{ loginCaptchaId }}"
            captchaAnswer: "{{ loginCaptchaAnswer }}"
          capture:
            - json: "$.token"
              as: "authToken"
      
      - think: 1
      
      # Get profile
      - get:
          url: "/api/profile"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "Existing User Login"
    weight: 50
    flow:
      # Get CAPTCHA
      - get:
          url: "/api/auth/captcha"
          capture:
            - json: "$.id"
              as: "captchaId"
            - json: "$.answer"
              as: "captchaAnswer"
      
      # Login with test user
      - post:
          url: "/api/auth/login"
          json:
            email: "kartik.dua@icloud.com"
            password: "Kartik@123"
            captchaId: "{{ captchaId }}"
            captchaAnswer: "{{ captchaAnswer }}"
          capture:
            - json: "$.token"
              as: "authToken"
      
      - think: 1
      
      # Get bookings
      - get:
          url: "/api/bookings/my"
          headers:
            Authorization: "Bearer {{ authToken }}"