test/load-tests/stress-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Ramp up"
    - duration: 120
      arrivalRate: 50
      name: "Stress test"
    - duration: 60
      arrivalRate: 100
      name: "Peak stress"
    - duration: 60
      arrivalRate: 10
      name: "Cool down"
  processor: "./load-test-processor.js"

scenarios:
  - name: "Mixed Load"
    weight: 100
    flow:
      - get:
          url: "/api/events"
      - think: 1
      - get:
          url: "/health"
      - think: 1
      - get:
          url: "/api/events?category=concert"